app/controllers/admin/base.rb

SELECT "administrators".* FROM "administrators" WHERE "administrators"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---

    private def current_administrator
        if session[:administrator_id]
            @current_administrator ||=
                Administrator.find_by(id: session[:administrator_id])