app/controllers/admin/staff_members_controller.rb

    def destroy
        staff_member = StaffMember.find(params[:id])
        staff_member.destroy!
---
DELETE FROM "staff_members" WHERE "staff_members"."id" = $1  [["id", 18]]