app/controllers/admin/staff_members_controller.rb

    def index
        @staff_members = StaffMember.order(:family_name_kana, :given_name_kana).page(params[:page])
---
SELECT "staff_members".* FROM "staff_members" ORDER BY "staff_members"."family_name_kana" ASC, "staff_members"."given_name_kana" ASC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "staff_members"

    def show
        staff_member = StaffMember.find(params[:id])
---
SELECT "staff_members".* FROM "staff_members" WHERE "staff_members"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

    def edit
        @staff_member = StaffMember.find(params[:id])
---
SELECT "staff_members".* FROM "staff_members" WHERE "staff_members"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

    def create
        @staff_member = StaffMember.new(staff_member_params)
        if @staff_member.save
---
INSERT INTO "staff_members" ("email", "family_name", "given_name", "family_name_kana", "given_name_kana", "hashed_password", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

    def update
        @staff_member = StaffMember.find(params[:id])
        @staff_member.assign_attributes(staff_member_params)
        if @staff_member.save
---
SELECT "staff_members".* FROM "staff_members" WHERE "staff_members"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "staff_members" SET "hashed_password" = $1, "end_date" = $2, "suspended" = $3, "updated_at" = $4 WHERE "staff_members"."id" = $5  [["hashed_password", "$2a$12$ugnlzV27SoBtVmNXxP9fXuMMxQB5tQhdYd0Q.l50khOfSzYN/eA7S"], ["end_date", "2020-04-16"], ["suspended", true], ["updated_at", "2020-04-16 01:49:54.079098"], ["id", 6]]

    def destroy
        staff_member = StaffMember.find(params[:id])
        staff_member.destroy!
---
SELECT "staff_members".* FROM "staff_members" WHERE "staff_members"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
DELETE FROM "staff_members" WHERE "staff_members"."id" = $1  [["id", 16]]