app/controllers/staff/accounts_controller.rb

UPDATE "staff_members" SET "given_name" = $1, "given_name_kana" = $2, "updated_at" = $3 WHERE "staff_members"."id" = $4  [["given_name", "小太郎"], ["given_name_kana", "コタロウ"], ["updated_at", "2020-04-14 06:36:05.114403"], ["id", 1]]
---
    def update
        @staff_member = current_staff_member
        @staff_member.assign_attributes(staff_member_params)
        if @staff_member.save