app/controllers/staff/customers_controller.rb

SELECT "customers".* FROM "customers" ORDER BY "customers"."family_name_kana" ASC, "customers"."given_name_kana" ASC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "customers"
---
    def index
        @customers = Customer.order(:family_name_kana, :given_name_kana)
        .page(params[:page])

SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]
---
    def edit
        @customer_form = Staff::CustomerForm.new(Customer.find(params[:id]))